{"method":"GET","status":"success","generated":"2023-06-03T11:04:59+08:00","conference":{"name":"HKOSCon 2023","sponsors":{"platinum":{"name":"Platinum","sponsors":[{"title":"Amazon Web Services","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2023-05\/AWS_logo_RGB.png?itok=Rcc-lHI6","description":"\u003Cp\u003E\u003Cstrong\u003EAbout Amazon Web Services\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESince 2006, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 99 Availability Zones within 31 geographic regions, with announced plans for 15 more Availability Zones and five more AWS Regions in Canada, Israel, Malaysia, New Zealand, and Thailand. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003E關於 Amazon Web Services\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003E自2006年來，Amazon Web Services一直在提供世界上服務最豐富、應用廣泛的雲端服務。AWS為客戶提供超過200種功能全面的雲端服務，包括運算、儲存、數據庫、網絡、分析、機器學習與人工智能、物聯網、流動、安全、混合雲、虛擬和擴增實境(VR 和AR)、媒體，以及應用開發、部署和管理等方面，遍及31個地理區域內的99個可用區域(Availability Zones)，並已公佈計畫在加拿大、以色列、馬來西亞、紐西蘭和泰國建立5個AWS地理區域、15個可用區域。AWS的服務獲得全球超過百萬客戶的信任，包括發展迅速的初創公司、大型企業和政府機構。通過AWS的服務，客戶能夠有效強化自身基礎設施，提高營運上的彈性與應變能力，同時降低成本。欲了解更多有關AWS的資訊，請瀏覽：https:\/\/aws.amazon.com。\u003C\/p\u003E\r\n","links":[{"title":"Website","url":"https:\/\/aws.amazon.com\/"}]}]}},"patrons":[]}}