{"method":"GET","status":"success","generated":"2023-06-01T18:35:43+08:00","days":[{"day":1,"date":"2023-06-09","timeslots":[{"startTime":"10:10","endTime":"10:40","events":[{"id":361,"topic":true,"remote_presentation":false,"display":"Build your AI-first apps faster with Semantic Kernel on Microsoft Azure","description":"\u003Cp\u003ESemantic Kernel (SK), available on GitHub as an open-source framework, is a lightweight SDK that lets you mix conventional programming languages, like C# and Python, with the latest in Large Language Model (LLM) AI \u0022prompts\u0022 with prompt templating, chaining, and planning capabilities. SK is accompanied by example apps and notebooks that illustrate how to get going quickly with LLM AI. Join us for an overview of this exciting new release from Microsoft, explore its core functionalities, and find out how to get started and working with Azure OpenAI.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"Cantonese","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Wai Man Hui","community":"Microsoft Hong Kong","country":"Hong Kong","description":"\u003Cp\u003ECloud Solution Architect\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMicrosoft Hong Kong Limited\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/WaiManHui.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/build-your-ai-first-apps-faster-semantic-kernel-microsoft-azure","time":{"date":"2023-06-09","startTime":"10:10","endTime":"10:40"},"timeslots":[{"date":"2023-06-09","startTime":"10:10","endTime":"10:40"}]}]},{"startTime":"10:50","endTime":"11:20","events":[{"id":414,"topic":true,"remote_presentation":false,"display":"Write and enforce fine-grained application permissions using Policy-as-Code with Cedar","description":"\u003Cp\u003ECedar is an open-source language and software development kit (SDK) for writing and enforcing authorization policies for your applications.\u0026nbsp; Using Cedar, you can express fine-grained permissions as easy-to-understand policies enforced in your applications, allowing you to decouple access control from your application logic. In this session, we will introduce the core concepts behind the Cedar policy language and authorization engine, as well as how you can leverage this open source project to add access control into your applications.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Clifford Duke","community":"Amazon Web Services","country":"Hong Kong","description":"\u003Cp\u003EClifford Duke joined Amazon Web Services as a Solutions Architect in February 2019. Coming from a software development background, he is passionate about helping customers build secure, reliable and scalable solutions for the modern cloud. Prior to AWS, Clifford worked at a media company leading a team of developers to modernize legacy systems and build out their big data architecture.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/clifford-duke-cropped-800x800.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/write-and-enforce-fine-grained-application-permissions-using-policy-code-cedar","time":{"date":"2023-06-09","startTime":"10:50","endTime":"11:20"},"timeslots":[{"date":"2023-06-09","startTime":"10:50","endTime":"11:20"}]}]},{"startTime":"11:30","endTime":"12:00","events":[{"id":362,"topic":true,"remote_presentation":false,"display":"Running Cloud Native Application with MySQL for Kubernetes","description":"\u003Cp\u003E\u003Cspan\u003EMicroservices decouple services which allow more self-contained work and require data store with more handy deployment. Kubernetes is one of the best ways orchestrating\/deploying services including MySQL Database. Cloud Native Applications running with data which requires reliability and resilience. In the session, we will explore the use of MySQL Operator for Kubernetes working with Cloud Native Application under K8s deployment. It provides the HA model for MySQL and Application working closely with K8s ExternalName Kind service to address to MySQL routing service. \u003C\/span\u003E\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"Cantonese","language_sym_interp":[],"level":"","speakers":[{"name":"Ivan Ma","community":"Hong Kong MySQL user group","country":"Hong Kong","description":"\u003Cp\u003EIvan Ma has over 20+ years with IT technologies around Databases, Infrastructure and projects development. He is leading the Hong Kong MySQL User Group. His career starts as developer from IBM TSO, S\/36, AS\/400, COBOL, RPG and as Consultant\/Principal Solution Architect in Sybase for over 10 years. He joined Oracle from the Sun Microsystems acquisition and now he is working in MySQL Team as Principal Solutions Engineer.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2021-06\/ivanma.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/running-cloud-native-application-mysql-kubernetes","time":{"date":"2023-06-09","startTime":"11:30","endTime":"12:00"},"timeslots":[{"date":"2023-06-09","startTime":"11:30","endTime":"12:00"}]}]},{"startTime":"12:10","endTime":"12:30","events":[{"id":363,"topic":true,"remote_presentation":false,"display":"Accelerating Operations with pdf2txt, GPT Summarization, and Azure OpenAI Service in the Open Source Ecosystem","description":"\u003Cp\u003EIn today\u0027s fast-paced world, businesses are constantly looking for ways to streamline their processes and accelerate decision-making. One such area is the evaluation and ranking of complex documents. This presentation will explore how leveraging open-source tools like pdf2txt, GPT summarization, and Azure OpenAI Service can help organizations automate and optimize their document evaluation processes while maintaining anonymity and confidentiality.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWe will demonstrate a three-level approach that combines the power of GPT models with human evaluation criteria, allowing organizations to efficiently analyze and rank documents based on their relevance and quality:\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EBasic Matching and Ranking: In this level, we will use pdf2txt for document extraction and GPT models to match description criteria with items. The system will then rank the items based on their relevance, providing a basic analysis of the documents.\u003C\/li\u003E\r\n\t\u003Cli\u003EIncorporating Human Evaluation Criteria: Building on the basic matching and ranking, we will introduce human evaluation criteria that guide the GPT models in their analysis. This approach allows for a more nuanced and human-like understanding of the documents, enabling more accurate and meaningful ranking.\u003C\/li\u003E\r\n\t\u003Cli\u003EGPT Model Fine-tuning with Human-ranked Samples: In the final level, we will provide the GPT models with samples of ranked items evaluated by human experts. The models will learn from these samples and fine-tune their ranking capabilities. Once trained, the GPT models can then be applied to new sets of documents, resulting in a more accurate and efficient ranking process that closely mirrors human judgment.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003EThis presentation will showcase how the combination of open-source technologies and innovative approaches can help organizations accelerate their operations and improve decision-making. Attendees will gain insights into the practical applications of these techniques and learn how to implement them in their own organizations to streamline processes and enhance efficiency.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Dr. Chung, NG","community":"HKT\/PCCW Group","country":"Hong Kong","description":"\u003Cp\u003EDr. Chung is a SVP at Group CTO Office of the HKT\/PCCW Group, where he’s responsible for leading the group’s product and technology roadmap and strategic development. He also represents the group as board members of Lynx Analytics and Bindo Labs.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBefore HKT\/PCCW, Chung contributed to the Big Data\/AI strategy at Telstra as well as its international growth strategy. Prior to Telstra, Chung was an Associate Partner of Cluster Technology Limited which serves the Greater China market with professional services and solutions in high-performance computing, machine learning, big data, and public cloud.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn 2008, Chung joined McKinsey \u0026amp; Company in the Hong Kong office. He received his DPhil in Information Engineering from the University of Oxford and held the Croucher Foundation Scholarship to work toward his research degree in wireless ad-hoc networks. Chung also received BEng and MPhil in Information Engineering from the Chinese University of Hong Kong.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Chung%20Ng.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/accelerating-operations-pdf2txt-gpt-summarization-and-azure-openai-service-open-source","time":{"date":"2023-06-09","startTime":"12:10","endTime":"12:30"},"timeslots":[{"date":"2023-06-09","startTime":"12:10","endTime":"12:30"}]}]},{"startTime":"12:30","endTime":"13:50","events":[{"id":394,"topic":false,"remote_presentation":false,"display":"Lunch","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/lunch-1","time":{"date":"2023-06-09","startTime":"12:30","endTime":"13:50"},"timeslots":[{"date":"2023-06-09","startTime":"12:30","endTime":"13:50"}]}]},{"startTime":"13:50","endTime":"14:20","events":[{"id":381,"topic":true,"remote_presentation":false,"display":"Innovate with Common Spatial Data Infrastructure (CSDI) Spatial Data","description":"\u003Cp\u003EThe Common Spatial Data Infrastructure (CSDI) is a key initiative under the Smart City Blueprint for Hong Kong. The CSDI portal launched by the Development Bureau (DEVB) provides a map-based digital infrastructure as a one-stop platform to open and share spatial data. By allowing members of the public to search, view and download various kinds of spatial data from the portal, a wide range of possibilities for application development will be opened, the digital economy boosted and quality of life improved. The Head of Spatial Data Office, DEVB will share the latest updates of CSDI and some relevant spatial data applications.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Sr YC Chan","community":"Spatial Data Office, Development Bureau","country":"Hong Kong","description":"\u003Cp\u003EHead of Spatial Data Office, Development Bureau\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMr. CHAN assumes the post of Head of Spatial Data Office in the Development Bureau, Government of the Hong Kong Special Administrative Region since late May 2021. His over 20 years professional experiences cover engineering surveying, hydrographic surveying, cadastral surveying, and geospatial data analysis\/management.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOver the past few years, Mr. CHAN has been actively involved in the smart city and CSDI development.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Sr%20YC%20Chan_square.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/innovate-common-spatial-data-infrastructure-csdi-spatial-data","time":{"date":"2023-06-09","startTime":"13:50","endTime":"14:20"},"timeslots":[{"date":"2023-06-09","startTime":"13:50","endTime":"14:20"}]}]},{"startTime":"14:24","endTime":"14:33","events":[{"id":382,"topic":true,"remote_presentation":false,"display":"Open Cultural Data Exchange of Sri Lankan Agricultural Village and Eco-Farm in Sheung Shui","description":"\u003Cp\u003EDigital heritage plays a crucial role in fueling a booming creative economy and serve educational goals. Open Cultural Data can speed up knowledge sharing between several cultural institutions and museums to digital images sharing projects. By understanding the impact statement of Sri Lankan Agricultural Village and Eco-Farm in Sheung Shui, developers are invited to publish street map and open cultural data for facilitating social integration of Sri Lankans residents in Hong Kong and value co-creation.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Leslie Lee","community":"International union of Professional Development Institutions","country":"Hong Kong","description":"\u003Cp\u003EChairman of International union of Professional Development Institutions\u003C\/p\u003E\r\n\r\n\u003Cp\u003EAfter retirement, Leslie serves as a volunteer Project Manager of Sri Lankan Agricultural Village and Eco-Farm with the purpose of providing a place for Sri Lankan to gather and do some traditional farming, opportunity for Hong Kong citizens and foreigners to socialize with Sri Lankan in order to understand each other’s culture and lifestyle for a harmonious society.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ELeslie invites developers to use open cultural data of this project to create Apps, which are viable for donation generation and developers’ own profit-making.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Leslie%20Lee_square.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/open-cultural-data-exchange-sri-lankan-agricultural-village-and-eco-farm-sheung-shui","time":{"date":"2023-06-09","startTime":"14:24","endTime":"14:33"},"timeslots":[{"date":"2023-06-09","startTime":"14:24","endTime":"14:33"}]}]},{"startTime":"14:34","endTime":"15:40","events":[{"id":383,"topic":true,"remote_presentation":false,"display":"Helping Residents in Subdivided Units using Data from Multiple Sources","description":"\u003Cp\u003ELocal communities can build data-driven capacity and resources to access data and leverage statistical, computational, and social science expertise to manage, analyze, and interpret data for improving the well-being of the residents in subdivided units. Residents there are also encouraged to record their own status, such as like temperature, humidity and air quality. Let’s join this dialogue process that is designed to discuss issues and data sources that span the boundaries of multiple stakeholders.\u003C\/p\u003E\r\n\r\n\u003Ch3\u003EModerator\u003C\/h3\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EProf. Ling Kar-kan SBS\u003C\/strong\u003E\u003Cbr \/\u003E\r\nDirector of Jockey Club Design Institute for Social Innovation\u003Cbr \/\u003E\r\nThe Hong Kong Polytechnic University\u003C\/p\u003E\r\n\r\n\u003Ch3\u003EPanelist\u003C\/h3\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\u003Cstrong\u003ESr YC CHAN\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\tHead of Spatial Data Office, Development Bureau\u003C\/li\u003E\r\n\t\u003Cli\u003E\u003Cstrong\u003EProf. John BACON-SHONE\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\tHead of Quality Analytics, HKU School of Professional and Continuing Education;\u003Cbr \/\u003E\r\n\tHonorary Professor, Faculty of Social Sciences, University of Hong Kong\u003C\/li\u003E\r\n\t\u003Cli\u003E\u003Cstrong\u003EMr Leslie Lee\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\tChairman of International union of Professional Development Institutions\u003C\/li\u003E\r\n\t\u003Cli\u003E\u003Cstrong\u003EMr Cyrus WONG\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\tSenior Lecturer, Department of Information Technology (IT) IVE (Lee Wai Lee)\u003C\/li\u003E\r\n\t\u003Cli\u003E\u003Cstrong\u003EMr Mendel Wong\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\tCo-founder and co-chair, CitizenScience.Asia\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Prof. Ling Kar-kan SBS","community":"Jockey Club Design Institute for Social Innovation","country":"Hong Kong","description":"\u003Cp\u003EDirector of Jockey Club Design Institute for Social Innovation\u003Cbr \/\u003E\r\nThe Hong Kong Polytechnic University\u003C\/p\u003E\r\n\r\n\u003Cp\u003EProf. Ling Kar-kan SBS is a professional town planner. He was the Director of Planning of HKSAR Government and President of the Hong Kong Institute of Planners. He is now the Director of Jockey Club Design Institute for Social Innovation of The Hong Kong Polytechnic University. He also serves the community as the Vice Chairman of the Hong Kong Housing Society, Director of the Hong Kong Cyberport Management Company Limited and Chairman of its Entrepreneurship Committee, and the Chairman of the Country and Marine Parks Board. He is also the Adjunct Professor of the University of Hong Kong and the Chinese University of Hong Kong, and Professor of Practice (Planning) of The Hong Kong Polytechnic University.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Prof.%20Ling%20Kar-kan%20SBS_square.jpg"},{"name":"Sr YC Chan","community":"Spatial Data Office, Development Bureau","country":"Hong Kong","description":"\u003Cp\u003EHead of Spatial Data Office, Development Bureau\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMr. CHAN assumes the post of Head of Spatial Data Office in the Development Bureau, Government of the Hong Kong Special Administrative Region since late May 2021. His over 20 years professional experiences cover engineering surveying, hydrographic surveying, cadastral surveying, and geospatial data analysis\/management.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOver the past few years, Mr. CHAN has been actively involved in the smart city and CSDI development.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Sr%20YC%20Chan_square.jpg"},{"name":"Prof. John Bacon-Shone","community":"The University of Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EHead of Quality Analytics, HKU School of Professional and Continuing Education; Honorary Professor, Faculty of Social Sciences, University of Hong Kong\u003C\/p\u003E\r\n\r\n\u003Cp\u003EProf. John Bacon-Shone is an applied Statistician. He is currently the Head of Quality Analytics for HKU Space. He was the Dean of Faculty of Social Sciences and Director of Social Sciences Research Centre in The University of Hong Kong, including three years on secondment to the Hong Kong Government assisting with the drafting of the Chief Executive\u0027s annual Policy Address, writing speeches and policy documents on health care, migration, population growth, opinion polls, education and technology. He was responsible for knowledge exchange and was the moving force in developing HKU\u0027s policy and procedures for research data management, including initiatives on open data and open access. Professor Bacon-Shone\u0027s research interests include statistical computing, survey methodology, compositional data, biostatistics, gambling, data archiving, privacy, socio-linguistics and policy research.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Prof.%20John%20Bacon-Shone_square.jpg"},{"name":"Leslie Lee","community":"International union of Professional Development Institutions","country":"Hong Kong","description":"\u003Cp\u003EChairman of International union of Professional Development Institutions\u003C\/p\u003E\r\n\r\n\u003Cp\u003EAfter retirement, Leslie serves as a volunteer Project Manager of Sri Lankan Agricultural Village and Eco-Farm with the purpose of providing a place for Sri Lankan to gather and do some traditional farming, opportunity for Hong Kong citizens and foreigners to socialize with Sri Lankan in order to understand each other’s culture and lifestyle for a harmonious society.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ELeslie invites developers to use open cultural data of this project to create Apps, which are viable for donation generation and developers’ own profit-making.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Leslie%20Lee_square.jpg"},{"name":"Cyrus Wong","community":"IVE","country":"Hong Kong","description":"\u003Cp\u003ECyrus Wong is Data Scientist of Cloud Innovation Centre at the IT Department of the Hong Kong Institute of Vocational Education (Lee Wai Lee). He has achieved all 12 AWS Certifications and actively promotes the use of AWS in different media and events. His projects received four Hong Kong ICT Awards in 2014, 2015, and 2016, and all winning projects are running solely on AWS with Data Science and Machine Learning. One of the winning projects is “AWS Cloud Lab Environment,” an open-sourced project for educators to create tailor-made lab environments on AWS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECyrus also helps to deliver the full-time course “Higher Diploma in Cloud and Data Centre Administration,” which is the first tertiary course in Asia dedicated to provide Cloud Technology training. The course is committed to providing AWS Academy training to Hong Kong students and Cyrus is an AWS Academy Accredited Trainer. He incorporates AI\/ML into his daily curriculum and often writes about projects. Examples include: Analyze Emotion in Video Frame Samples Using Amazon Rekognition on AWS, Build an Amazon Lex Chatbot with Microsoft Excel, and Using AWS AI and Amazon Sumerian in IT Education.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Cyrus%20Wong_square.jpg"},{"name":"Mendel Wong","community":"CitizenScience.Asia","country":"Hong Kong","description":"\u003Cp\u003EMendel Wong is the Co-Founder and Co-Chair of \u003Ca href=\u0022https:\/\/citizenscience.asia\/\u0022\u003ECitizenScience.Asia\u003C\/a\u003E, a community and organization established in response to the lack of a unified voice for Asia in matters relating to citizen science. The goal is to connect the regional citizen science communities and help share their stories. Mendel is also a Board Member for the Citizen Science Global Partnership and External Advisor Board Member for CS Track. Outside of citizen science, Mendel is a technology executive in the finance industry fuelling his passion in facilitating solutions that leave strong positive experience and impact.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Mr%20Mendel%20Wong_aquare.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/helping-residents-subdivided-units-using-data-multiple-sources","time":{"date":"2023-06-09","startTime":"14:34","endTime":"15:40"},"timeslots":[{"date":"2023-06-09","startTime":"14:34","endTime":"15:40"}]}]},{"startTime":"15:40","endTime":"16:10","events":[{"id":395,"topic":false,"remote_presentation":false,"display":"Tea Break","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/tea-break","time":{"date":"2023-06-09","startTime":"15:40","endTime":"16:10"},"timeslots":[{"date":"2023-06-09","startTime":"15:40","endTime":"16:10"}]}]},{"startTime":"16:10","endTime":"16:40","events":[{"id":366,"topic":true,"remote_presentation":false,"display":"Universal Acceptance: The Standard to an Open, Inclusive and Compatible Internet","description":"","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Edmon Chung","community":"ICANN Board IDN-UA Working Group","country":"Hong Kong","description":"\u003Cp\u003EEdmon Chung is a social innovator and entrepreneur. Edmon currently serves as the CEO of DotAsia Organisation, serves on the Executive Committee of Internet Society Hong Kong (ISOC HK), the Board of Make a Difference (MaD) Institute, and heads the secretariat for the Asia Pacific Regional Internet Governance Forum (APrIGF). Edmon served also on the founding board of the Internet Governance Forum Support Association (IGFSA), continues to support its secretariat, cofounded the annual Hong Kong Kids International Film Festival (KIFF.Asia), and participates extensively on Internet governance and social innovation matters. Edmon is an inventor of patents of internationalized domain names (IDN) and email addresses technologies, and has served on many global IDN related technical and policy groups, that made possible the introduction of multilingual domain names and email addresses on the Internet. Edmon won the Most Innovative Award in the Chinese Canadian Entrepreneurship Award in 2001. In 2000, Edmon was selected by The Globe and Mail as one of the Young Canadian Leaders.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBetween 2006 and 2010, Edmon served on the ICANN Generic Names Supporting Organization (GNSO) Council, between 2010 and 2012 on the ICANN At-Large Advisory Committee (ALAC), and between 2006 and 2011, as an elected member of the Elections Committee of the Hong Kong Special Administrative Region in the Information Technology Subsector. Edmon has a Bachelor of Applied Science and Master of Engineering from the University of Toronto. He was nominated to serve on the ICANN Board by the Nominating Committee in 2021. His term will expire at the Annual General Meeting in 2024.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/edmon.jpeg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/universal-acceptance-standard-open-inclusive-and-compatible-internet","time":{"date":"2023-06-09","startTime":"16:10","endTime":"16:40"},"timeslots":[{"date":"2023-06-09","startTime":"16:10","endTime":"16:40"}]}]},{"startTime":"16:50","endTime":"17:20","events":[{"id":364,"topic":true,"remote_presentation":false,"display":"Proven software development workflows the OSS way, for your growing business","description":"\u003Cp\u003EMany aspiring businesses in various industries need to make use of software as they grow. Open source software development workflows generally allows businesses to keep costs low, are scalable and are also proven to work across different locations, cultures and timezones. In this talk, Gary aims to share the importance of having a good software coding foundation for your business, especially if the business is not purely software-focused. He will share essential parts of a coding foundation that even the tech giants use, thus you can be rest assured of their proven scalability.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[{"name":"Gary Kwong","community":"yGit Software","country":"","description":"\u003Cp\u003EGary Kwong has been involved in open source for over 20 years. He was part of Mozilla as a volunteer, intern, full-time employee for almost 9 years, and even as security bug hunter hall-of-famer for subsequent years. Gary lived for an extensive period of time in the San Francisco Bay Area where he had personal knowledge on how large tech giants operated and close contacts with the tech talent there that coalesced from the rest of the world. He speaks English, Mandarin and Cantonese fluently and now runs his own software consultancy business based out of Vancouver, Canada, specializing in helping clients based in Asia.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/gary-squared.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/proven-software-development-workflows-oss-way-your-growing-business","time":{"date":"2023-06-09","startTime":"16:50","endTime":"17:20"},"timeslots":[{"date":"2023-06-09","startTime":"16:50","endTime":"17:20"}]}]},{"startTime":"17:30","endTime":"18:00","events":[{"id":365,"topic":true,"remote_presentation":false,"display":"分散式出版面對的三道圍牆","description":"\u003Cp\u003E傳統紙本書已經持續式微多年，買書的讀者越來越少之餘，近年還多了審查的要求。另一邊廂，發展多年的電子書雖然解決了如存倉、物流、印刷等部分問題，但亦衍生了通路和平台壟斷等問題。\u003C\/p\u003E\r\n\r\n\u003Cp\u003E本專題將分享分散式出版如何以 NFT 書的全新方式演繹、發行與銷售電子書，以面對資訊審查、封閉花園以及通路壟斷三道圍牆，提供現實案例，介紹分散式出版的的特色如：\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E文本以共享創意授權，保障知識流通\u003C\/li\u003E\r\n\t\u003Cli\u003E畫師設計每本獨一無二的封面\u003C\/li\u003E\r\n\t\u003Cli\u003E文本和封面均存放於分散式存儲如 ipfs，抗衡竄改及流失\u003C\/li\u003E\r\n\t\u003Cli\u003E透過 NFT 認證每本書的擁有權，創造收藏的條件\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E等等\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"Cantonese","language_sym_interp":[],"level":"","speakers":[{"name":"Kin Ko","community":"LikeCoin Foundation","country":"Hong Kong","description":"\u003Cp\u003E地球人。\u003Ca href=\u0022https:\/\/like.co\/\u0022\u003ELikeCoin\u003C\/a\u003E、\u003Ca href=\u0022https:\/\/decentralizehk.org\/\u0022\u003E#decentralizehk\u003C\/a\u003E 發起人，\u003Ca href=\u0022https:\/\/creativecommons.org\/\u0022\u003ECreative Commons\u003C\/a\u003E 成員。\u003C\/p\u003E\r\n\r\n\u003Cp\u003E創業者。信仰民主自由、開放多元，左而不膠；人文為體，科技為用。香港中文大學計算機工程學士、副修社會學、政治及行政；資訊科技管理碩士。於民間學院任教《\u003Ca href=\u0022https:\/\/ckxpress.com\/the-sociology-of-blockchain\/financial-freedom-course\/\u0022\u003E區塊鏈社會學\u003C\/a\u003E》。\u003C\/p\u003E\r\n\r\n\u003Cp\u003E創作者。文章見於《蘋果日報》專欄 \u003Ca href=\u0022https:\/\/hk.appledaily.com\/author\/16633471\/\u0022\u003E#decentralizehk\u003C\/a\u003E、\u003Ca href=\u0022https:\/\/www.thestandnews.com\/author\/ckxpress\/\u0022\u003E立場新聞\u003C\/a\u003E、\u003Ca href=\u0022https:\/\/matters.news\/@ckxpress\u0022\u003EMatters\u003C\/a\u003E 等各公民媒體，並全數收錄於 \u003Ca href=\u0022https:\/\/ckxpress.com\/\u0022\u003Eckxpress.com\u003C\/a\u003E。\u003C\/p\u003E\r\n\r\n\u003Cp\u003E沒有固定手機號碼，但一封電郵就能輕鬆聯繫上—— \u003Ca href=\u0022mailto:kin@ckxpress.com\u0022\u003Ekin@ckxpress.com\u003C\/a\u003E。\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECitizen of the Earth. Believer in democracy, freedom and diversity. Professional in technology, yet always with humanity in mind.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EEntrepreneur. Founder of LikeCoin and #decentralizehk. Member of Creative Commons. Graduated from The Chinese University of Hong Kong with major in Computer Engineering and minor in Sociology and Government \u0026amp; Public Administration. Master of Information Technology Management. Part-time lecturer of The Sociology of Blockchain at Intercommon Education.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWriter. Works found in Apple Daily’s column \u0026lt;#decentralizehk\u0026gt;, various civic media and personal blog ckxpress.com. Published The Road of Game and The Sociology of Blockchain.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2021-06\/01.png"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/fensanshichubanmianduidesandaoweiqiang","time":{"date":"2023-06-09","startTime":"17:30","endTime":"18:00"},"timeslots":[{"date":"2023-06-09","startTime":"17:30","endTime":"18:00"}]}]}]},{"day":2,"date":"2023-06-10","timeslots":[{"startTime":"10:00","endTime":"10:30","events":[{"id":412,"topic":true,"remote_presentation":false,"display":"Platform engineering with Django","description":"\u003Cp\u003EPlatform engineering, also known as an \u0022Internal Developer Platform\u0022 aims to provide developers with a seamless and efficient environment to manage the entire lifecycle of an application. Django, a popular open-source web framework, is known for its rapid development capabilities and clean, pragmatic design. By leveraging its built-in features, one can expedite the process of developing platform engineering solutions. In this session, I will share my experience using Django for platform engineering at an AI company.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Ko Ko","community":"","country":"Taiwan","description":"\u003Cp\u003EMicrosoft AI MVP \/ Chatbot Developers Taiwan\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan\u003EKo Ko is a Microsoft AI MVP and a popular lecturer in Taiwan. He was invited to many technical presentations, including COSCUP, .NET conference, ModernWeb, PyCon APAC, DevDays Asia and so on, which had more than 10,000 participants in total. He loves sharing his experience and what he learned to the audience, and he believes those sharing can make each other better. \u003C\/span\u003E\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/5003846.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/platform-engineering-django","time":{"date":"2023-06-10","startTime":"10:00","endTime":"10:30"},"timeslots":[{"date":"2023-06-10","startTime":"10:00","endTime":"10:30"}]},{"id":372,"topic":true,"remote_presentation":false,"display":"How to use verilator","description":"\u003Cp\u003EThere are many different kinds of programming paradigm such as high-level coding and low-level coding. Verilog is another kind of paradigm, this talk will bring an introduction how coding in Verilog looks like and help audiences to jump start on it.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E(廣東話) Programming 有幾種係人都feel到唔同嘅大，例如high level programming就同low level programming好唔同。而Verilog又係另一種好唔同嘅編程範式，希望係呢個talk為大家介紹同埋幫大家極速起手。\u003C\/p\u003E\r\n\r\n\u003Cp\u003E(書面語) Programming有兩大範式 : 高級語言(python\/java)和底級語言(assembly), 而verilog是有別於以上兩大類的另一編程範式, 希望係此演講為大家介紹和令大家起步編寫verilog。\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"Cantonese","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Peter Cheung","community":"Quantr Foundation","country":"Hong Kong","description":"\u003Cp\u003EDeveloper from Hong Kong, doing few open source projects\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/peter-cheung.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-use-verilator","time":{"date":"2023-06-10","startTime":"10:00","endTime":"10:30"},"timeslots":[{"date":"2023-06-10","startTime":"10:00","endTime":"10:30"}]}]},{"startTime":"10:40","endTime":"11:10","events":[{"id":375,"topic":true,"remote_presentation":false,"display":"How I make a podcast website using serverless technology in 2023","description":"\u003Cp\u003EIn 2022, I launched a Kotlin podcast show, Kotlin Fireside Chat, with my friends in Kotlin User Group. Now, we\u0027re taking things to the next level by building a podcast website with a statistical analysis dashboard. We\u0027ve built a static website using Jamstack and connected it to a serverless API written in Kotlin. In order to aggregate the listener number across platforms, such as YouTube, BiliBili, Ximalaya, Lizhi, Qingting, we\u0027ve also created a crawler to grab those numbers and display them in a custom dashboard. Everything is made by open source technology and deployed on Google Cloud Platform. In this talk, I\u0027ll share my experience and the lessons I learned when using all the technologies in 2023.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Shengyou Fan","community":"JetBrains","country":"Taiwan","description":"\u003Cp\u003EShengyou is a developer advocate in JetBrains. Focus on web technology and backend development. He is fascinated with researching new technology and fond of skills that increase productivity. In charge of promoting technology such as Kotlin, IntelliJ IDEA and providing solutions. Love open source technologies and communities.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/shengyou-1000x1000.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-i-make-podcast-website-using-serverless-technology-2023","time":{"date":"2023-06-10","startTime":"10:40","endTime":"11:10"},"timeslots":[{"date":"2023-06-10","startTime":"10:40","endTime":"11:10"}]},{"id":373,"topic":true,"remote_presentation":false,"display":"Interesting cases and tips in 2 years of Postgres experience","description":"\u003Cp\u003EI want to talk about some interesting cases and tips that I met when using Postgres in my daily job, which are topics general enough that most developer may also meet in their daily jobs (even for non-Postgres developers).\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EWhy LIMIT 1 is MUCH SLOWER than LIMIT 100?\u003C\/li\u003E\r\n\t\u003Cli\u003EWhat\u0027s wrong with JSONB? (hint: it\u0027s TOO robust)\u003C\/li\u003E\r\n\t\u003Cli\u003EEfficient query using LATERAL subquery (from 8s to 0.08s)\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Chung Wu","community":"Liker Land","country":"Hong Kong","description":"\u003Cp\u003EBlockchain Developer from Liker Land\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/chung-wu.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/interesting-cases-and-tips-2-years-postgres-experience","time":{"date":"2023-06-10","startTime":"10:40","endTime":"11:10"},"timeslots":[{"date":"2023-06-10","startTime":"10:40","endTime":"11:10"}]}]},{"startTime":"11:20","endTime":"11:50","events":[{"id":410,"topic":true,"remote_presentation":false,"display":"How to Implement an Email Subscription and Delivery System - Using COSCUP Newsletter Subscription as an Example","description":"\u003Cp\u003EThis session will guide you through the process of building a comprehensive email subscription and delivery system, starting from domain and email configuration. We will discuss how to establish a subscription system, verify unique accounts, effectively manage subscriber lists, set up email tracking, create email templates, perform bulk sending, and avoid bouncebacks and related issues.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThis session uses the monthly COSCUP newsletter as an example. As COSCUP events no longer require registration and are open to anyone, there is a need to establish an email newsletter subscription service. You may wonder why you should build your own system instead of using existing online email delivery services. We will explain this question in detail during this session.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ENote: The project is still being organized and is expected to be made public before COSCUP 2023.\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003ETechnology breakdown: 60% (AWS SES, Python, Celery, RabbitMQ)\u003C\/li\u003E\r\n\t\u003Cli\u003EProcess overview: 30% (subscription, copywriting, email template creation, sending, list maintenance)\u003C\/li\u003E\r\n\t\u003Cli\u003EPro tips: 10% (email tracking, unsubscribe handling, etc.)\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[{"name":"Toomore Chiang","community":"COSCUP","country":"Taiwan","description":"\u003Cp\u003EI am currently the Head of the Administrative Team for COSCUP 2023, responsible for volunteer-related matters each year. The administrative team has developed two main systems: the \u003Ca href=\u0022https:\/\/volunteer.coscup.org\/\u0022\u003EVolunteer Service Platform\u003C\/a\u003E and the \u003Ca href=\u0022https:\/\/secretary.coscup.org\/subscribe\/coscup\u0022\u003ENewsletter Subscription System\u003C\/a\u003E. We aim to improve administrative efficiency and assist other teams in enhancing their performance, enabling the annual organizing team to act swiftly.\u0026nbsp; The Administrative Team is currently divided into three task groups: General Affairs, Development, and Recruitment. For more detailed information, please refer to the \u003Ca href=\u0022https:\/\/volunteer.coscup.org\/docs\/en\/secretary_team\/recruit\/\u0022\u003EAdministrative Team introduction\u003C\/a\u003E.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/toomore_0.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-implement-email-subscription-and-delivery-system-using-coscup-newsletter-subscription","time":{"date":"2023-06-10","startTime":"11:20","endTime":"11:50"},"timeslots":[{"date":"2023-06-10","startTime":"11:20","endTime":"11:50"}]}]},{"startTime":"11:20","endTime":"12:00","events":[{"id":416,"topic":true,"remote_presentation":false,"display":"Dynamic Kubernetes based Feature Environment on AWS","description":"","venue":{"name":"Function Hall","weight":2},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Peter Wong","community":"Prenetics","country":"Hong Kong","description":"\u003Cp\u003EDr. Peter Wong is the Chief Technology Officer of Prenetics and the Chief Information Officer (Interim) of ACT Genomics. Since he joined Prenetics in 2017, Dr. Wong has been leading Prenetics’ global technology vision and roadmap, and engineering delivery. Prior to Prenetics, Dr. Wong was the Head of Engineering at Travelex, where he led Travelex’s first digital transformation and B2B business. Dr. Wong also successfully delivered a brand new international money transfer service, Travelex Wire, and launched Travelex’s first international payment platform with the World Bank Group. Dr. Wong has experience across various industries including investment banking and eCommerce; and is a frequent speaker at technology events including AWS Summit and various universities. Dr. Wong holds a Doctorate degree in Computer Science from the University of Oxford, and B.Sc. and M.Sc. degrees in Computer Science from the University of Warwick.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/peter-wong.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/dynamic-kubernetes-based-feature-environment-aws","time":{"date":"2023-06-10","startTime":"11:20","endTime":"12:00"},"timeslots":[{"date":"2023-06-10","startTime":"11:20","endTime":"12:00"}]}]},{"startTime":"12:00","endTime":"12:30","events":[{"id":411,"topic":true,"remote_presentation":false,"display":"COSCUP Booth Team Journey","description":"\u003Cp\u003EThe COSCUP Booth Team is a newly established group this year, primarily responsible for setting up booths in various locations. You may wonder why this group was specifically formed and what it has accomplished since its establishment.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn this session, I will share the reasons behind my decision to establish this group, as well as the activities undertaken after its formation and the impact it has had on COSCUP.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Susu","community":"COSCUP","country":"","description":"\u003Cp\u003EI am a software engineer and a traveler, currently a member of the COSCUP Booth Team. I recently decided to start writing, and if you\u0027re interested, you can drop by my blog for a visit.\u0026nbsp; \u003Ca href=\u0022https:\/\/blog.sudosu.tw\/\u0022\u003Ehttps:\/\/blog.sudosu.tw\u003C\/a\u003E\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/IMG_0298-03.jpeg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/coscup-booth-team-journey","time":{"date":"2023-06-10","startTime":"12:00","endTime":"12:30"},"timeslots":[{"date":"2023-06-10","startTime":"12:00","endTime":"12:30"}]}]},{"startTime":"12:30","endTime":"13:50","events":[{"id":396,"topic":false,"remote_presentation":false,"display":"Lunch","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/lunch-2","time":{"date":"2023-06-10","startTime":"12:30","endTime":"13:50"},"timeslots":[{"date":"2023-06-10","startTime":"12:30","endTime":"13:50"}]}]},{"startTime":"13:50","endTime":"14:20","events":[{"id":367,"topic":true,"remote_presentation":false,"display":"Introducing Unikraft: An SDK for fast, secure, and highly-specialized unikernels","description":"\u003Cp\u003EUnikernels are specialized operating system images that execute a single application. Through extreme specialization they can provide high performance, small memory footprints, fast boot times, and a reduced attack vector.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThis talk will provide an overview of Unikraft (https:\/\/unikraft.org), a Linux Foundation project that provides a toolikit for creating highly specialized unikernels by combining a set of micro-libraries to tailor down the operating system strictly to the needs of the executing application.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESpecifically we will look at what Unikraft is and what it can be used for; how Unikraft achieves millisecond boot times, memory footprints in the order of KiB, and guaranteed higher performance in commonly deployed applications that Linux; Unikraft\u0027s security properties, both in terms of a reduced trusted compute base (TCB), and also in terms of supported security mitigations; ways to migrate existing applications to Unikraft with minimal effort both at the source level (POSIX), the binary level (Linux ABI), or through Unikraft\u0027s support for interpreted languages like Go, Javascript, Python, Rust, and WebAssembly; and - last but not least - the amazing and evergrowing open source community of Unikraft.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Michalis Pappas","community":"Unikraft","country":"Germany","description":"\u003Cp\u003EMichalis is an engineer at Unikraft Cloud (\u003Ca href=\u0022https:\/\/unikraft.io\u0022\u003Ehttps:\/\/unikraft.io\u003C\/a\u003E), and a contributor to the open source Unikraft project (\u003Ca href=\u0022https:\/\/unikraft.org\u0022\u003Ehttps:\/\/unikraft.org\u003C\/a\u003E). His areas of focus are operating systems, lightweight virtualization, and security. Before joining Unikraft he worked on virtualization for embedded automotive systems and Trusted Execution Environments.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/michalispappas.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/introducing-unikraft-sdk-fast-secure-and-highly-specialized-unikernels","time":{"date":"2023-06-10","startTime":"13:50","endTime":"14:20"},"timeslots":[{"date":"2023-06-10","startTime":"13:50","endTime":"14:20"}]},{"id":374,"topic":true,"remote_presentation":false,"display":"Adapting your Apps\/Systems with Universal Acceptance Standard","description":"\u003Cp\u003EThe Domain Name System (DNS) has changed dramatically over the last decade. There are now more than 1,200 active generic Top-Level Domains (gTLDs) representing many different scripts and character strings of varying length (e.g., .дети, .london, .engineering). There are also more than 60 Internationalized Domain Names (IDNs) country code top-level domains (ccTLDs) representing global communities online in native scripts (e.g., .ไทย).\u003C\/p\u003E\r\n\r\n\u003Cp\u003EUniversal Acceptance (UA) is the cornerstone to a digitally inclusive and open Internet because it ensures all domain names and email addresses – in any language, script, or new or long TLD (e.g., .在线, .photography) – are accepted equally by all Internet-enabled applications, devices, and systems.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe DNS will soon face another boom of Top-Level Domains with the next round of New gTLD program launching. To make sure your applications\/systems are compatible, competitive and inclusive, learn about how to become UA-ready now!\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWhat could you get in this Universal Acceptance Track?\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003ETechnical Overview on the requirements \u0026amp; standards of Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EA hands-on programming (Java \u0026amp; Python) and coding tutorials to make your apps\/systems UA-ready\u003C\/li\u003E\r\n\t\u003Cli\u003EA technical know-how on Email Address Internationalization (EAI)\u003C\/li\u003E\r\n\t\u003Cli\u003ESharing of Open Sources Projects on Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EIntroduction to the Readiness framework for developers\u003C\/li\u003E\r\n\t\u003Cli\u003EOther relevant RFCs, tools and resources available\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Ben Cheng","community":"Internet Society Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EBen Cheng is a young entrepreneur in IT industry, Co-founder of Oursky, and Board of Directors of Internet Society Hong Kong.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHis award-winning team Oursky have launched a number of apps with over 3 Million downloads on both iOS and Android platforms. Their apps have also been featured as Best of the week \/ Best of 2013 by Apple, among other prestigious apps.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESince 2008, Ben and his team create quality web and mobile apps for small businesses and consumer users through consultation, design and agile coding. They also develop in-house products such as FormX.ai, Authgear, Pandaform.com, Retain.cc, FileSQ.com with great passion.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/ben-cheng.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/adapting-your-appssystems-universal-acceptance-standard","time":{"date":"2023-06-10","startTime":"13:50","endTime":"15:40"},"timeslots":[{"date":"2023-06-10","startTime":"13:50","endTime":"14:20"},{"date":"2023-06-10","startTime":"14:30","endTime":"15:00"},{"date":"2023-06-10","startTime":"15:10","endTime":"15:40"}]}]},{"startTime":"14:30","endTime":"15:00","events":[{"id":368,"topic":true,"remote_presentation":false,"display":"Multi-robot autonomous exploration in 2D","description":"\u003Cp\u003EThis project demonstrates that multiple robots can collaborate to explore an unknown environment without GPS to generate a map with reasonable accuracy. This addresses exploration as a problem in the planning layer of the robotics domain. A frontier-based\u0026nbsp; exploration methodology will be explained. The main approach uses Rapidly-expanding Random Trees for frontier detection, and map merging for information sharing. The developed algorithm also makes use of existing solutions for SLAM, and path planning. The algorithm runs in a network of robots, and a master machine on ROS. The project shows that using multiple robots can reduce exploration time compared to using a single robot.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Sean Chok","community":"Deploifai","country":"Hong Kong","description":"\u003Cp\u003E\u003Cspan\u003EI am a recent mechanical engineering graduate from HKU, with a minor in computer science with a passion in cloud services and robotics. I am also a co-founder of Deploifai. We\u0027re building MLOps tools for ML developers so that they don\u0027t need to worry about cloud infrastructure management. Our platform provides ready-to-go GPU servers for model training and data science, and application containerization with model inference endpoints, and other ML-related cloud services.\u003C\/span\u003E\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/98sean98.png"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/multi-robot-autonomous-exploration-2d","time":{"date":"2023-06-10","startTime":"14:30","endTime":"15:00"},"timeslots":[{"date":"2023-06-10","startTime":"14:30","endTime":"15:00"}]},{"id":374,"topic":true,"remote_presentation":false,"display":"Adapting your Apps\/Systems with Universal Acceptance Standard","description":"\u003Cp\u003EThe Domain Name System (DNS) has changed dramatically over the last decade. There are now more than 1,200 active generic Top-Level Domains (gTLDs) representing many different scripts and character strings of varying length (e.g., .дети, .london, .engineering). There are also more than 60 Internationalized Domain Names (IDNs) country code top-level domains (ccTLDs) representing global communities online in native scripts (e.g., .ไทย).\u003C\/p\u003E\r\n\r\n\u003Cp\u003EUniversal Acceptance (UA) is the cornerstone to a digitally inclusive and open Internet because it ensures all domain names and email addresses – in any language, script, or new or long TLD (e.g., .在线, .photography) – are accepted equally by all Internet-enabled applications, devices, and systems.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe DNS will soon face another boom of Top-Level Domains with the next round of New gTLD program launching. To make sure your applications\/systems are compatible, competitive and inclusive, learn about how to become UA-ready now!\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWhat could you get in this Universal Acceptance Track?\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003ETechnical Overview on the requirements \u0026amp; standards of Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EA hands-on programming (Java \u0026amp; Python) and coding tutorials to make your apps\/systems UA-ready\u003C\/li\u003E\r\n\t\u003Cli\u003EA technical know-how on Email Address Internationalization (EAI)\u003C\/li\u003E\r\n\t\u003Cli\u003ESharing of Open Sources Projects on Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EIntroduction to the Readiness framework for developers\u003C\/li\u003E\r\n\t\u003Cli\u003EOther relevant RFCs, tools and resources available\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Ben Cheng","community":"Internet Society Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EBen Cheng is a young entrepreneur in IT industry, Co-founder of Oursky, and Board of Directors of Internet Society Hong Kong.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHis award-winning team Oursky have launched a number of apps with over 3 Million downloads on both iOS and Android platforms. Their apps have also been featured as Best of the week \/ Best of 2013 by Apple, among other prestigious apps.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESince 2008, Ben and his team create quality web and mobile apps for small businesses and consumer users through consultation, design and agile coding. They also develop in-house products such as FormX.ai, Authgear, Pandaform.com, Retain.cc, FileSQ.com with great passion.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/ben-cheng.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/adapting-your-appssystems-universal-acceptance-standard","time":{"date":"2023-06-10","startTime":"13:50","endTime":"15:40"},"timeslots":[{"date":"2023-06-10","startTime":"13:50","endTime":"14:20"},{"date":"2023-06-10","startTime":"14:30","endTime":"15:00"},{"date":"2023-06-10","startTime":"15:10","endTime":"15:40"}]}]},{"startTime":"15:10","endTime":"15:40","events":[{"id":369,"topic":true,"remote_presentation":false,"display":"Playing with Raspberry Pi - looking into the use case and play by yourself","description":"\u003Cp\u003ERaspberry Pi already know well and many of you now using for your DIY hobbies and business. Do you are having fun playing with it\/Is Raspberry Pi useful for your business? Masafumi will give a talk with a couple of use cases, demonstrate some of Raspberry Pi DIY gadgets and discuss what the use case is good to apply your DIY hobby\/business projects.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Masafumi Ohta","community":"Japanese Raspberry Pi Users Group","country":"Japan","description":"\u003Cp\u003EMasafumi is now leading the Raspberry Pi community in Japan and has been \u0027officially\u0027 volunteering at Raspberry Pi Foundation\/Trading since 2012 from the farthest eastern country - \u0027Japan.\u0027 Now, he moderates the Japanese language category on Raspberry Pi\u0027s official forum and helping their business not only in Japan but also in Asian areas ( Taiwan, China Mainland, and Korea ). and Masafumi is teaching \u0027OpenSource License\u0027\u0026nbsp; at a major Japanese University so that younger developer (students) could deal\/understand its license correctly. For more information, please visit his about.me website https:\/masafumi.me\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/BP3u2f6g.jpeg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/playing-raspberry-pi-looking-use-case-and-play-yourself","time":{"date":"2023-06-10","startTime":"15:10","endTime":"15:40"},"timeslots":[{"date":"2023-06-10","startTime":"15:10","endTime":"15:40"}]},{"id":374,"topic":true,"remote_presentation":false,"display":"Adapting your Apps\/Systems with Universal Acceptance Standard","description":"\u003Cp\u003EThe Domain Name System (DNS) has changed dramatically over the last decade. There are now more than 1,200 active generic Top-Level Domains (gTLDs) representing many different scripts and character strings of varying length (e.g., .дети, .london, .engineering). There are also more than 60 Internationalized Domain Names (IDNs) country code top-level domains (ccTLDs) representing global communities online in native scripts (e.g., .ไทย).\u003C\/p\u003E\r\n\r\n\u003Cp\u003EUniversal Acceptance (UA) is the cornerstone to a digitally inclusive and open Internet because it ensures all domain names and email addresses – in any language, script, or new or long TLD (e.g., .在线, .photography) – are accepted equally by all Internet-enabled applications, devices, and systems.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe DNS will soon face another boom of Top-Level Domains with the next round of New gTLD program launching. To make sure your applications\/systems are compatible, competitive and inclusive, learn about how to become UA-ready now!\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWhat could you get in this Universal Acceptance Track?\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003ETechnical Overview on the requirements \u0026amp; standards of Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EA hands-on programming (Java \u0026amp; Python) and coding tutorials to make your apps\/systems UA-ready\u003C\/li\u003E\r\n\t\u003Cli\u003EA technical know-how on Email Address Internationalization (EAI)\u003C\/li\u003E\r\n\t\u003Cli\u003ESharing of Open Sources Projects on Universal Acceptance\u003C\/li\u003E\r\n\t\u003Cli\u003EIntroduction to the Readiness framework for developers\u003C\/li\u003E\r\n\t\u003Cli\u003EOther relevant RFCs, tools and resources available\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Ben Cheng","community":"Internet Society Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EBen Cheng is a young entrepreneur in IT industry, Co-founder of Oursky, and Board of Directors of Internet Society Hong Kong.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHis award-winning team Oursky have launched a number of apps with over 3 Million downloads on both iOS and Android platforms. Their apps have also been featured as Best of the week \/ Best of 2013 by Apple, among other prestigious apps.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESince 2008, Ben and his team create quality web and mobile apps for small businesses and consumer users through consultation, design and agile coding. They also develop in-house products such as FormX.ai, Authgear, Pandaform.com, Retain.cc, FileSQ.com with great passion.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/ben-cheng.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/adapting-your-appssystems-universal-acceptance-standard","time":{"date":"2023-06-10","startTime":"13:50","endTime":"15:40"},"timeslots":[{"date":"2023-06-10","startTime":"13:50","endTime":"14:20"},{"date":"2023-06-10","startTime":"14:30","endTime":"15:00"},{"date":"2023-06-10","startTime":"15:10","endTime":"15:40"}]}]},{"startTime":"15:40","endTime":"16:10","events":[{"id":397,"topic":false,"remote_presentation":false,"display":"Tea Break","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/tea-break-0","time":{"date":"2023-06-10","startTime":"15:40","endTime":"16:10"},"timeslots":[{"date":"2023-06-10","startTime":"15:40","endTime":"16:10"}]}]},{"startTime":"16:10","endTime":"16:40","events":[{"id":370,"topic":true,"remote_presentation":false,"display":"Matter matters! A brief intro to the new smart home standard and how Home Assistant supports it","description":"\u003Cp\u003EIn HKOSCon 2022, we discussed how Home Assistant could help to bridge the gaps between smart home products from different camps with local control in mind. We touch-based on the emerging yet promising Matter standard that hoped to resolve a lot of the interpretability challenges of different smart home ecosystems. One year on, products that comply with the Matter standard start to appear, and Home Assistant has also evolved to provide better support for Matter products. In this session, we will discuss the Matter standard and how it works, the pros and cons of using Matter products on a particular ecosystem (Google \/ Apple \/ Amazon) versus connecting them all to Home Assistant, and how you shall plan for your investments of smart home products in the coming year.\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Amanda Lam","community":"Women Techmakers Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EAmanda manages digital products at Hong Kong Disneyland. She is also an organiser of ProductTank Hong Kong and Women Techmakers Hong Kong, and co-hosts one of the most popular Cantonese tech podcast, HKPUG Podcast.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/amanda-lam-squared.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/matter-matters-brief-intro-new-smart-home-standard-and-how-home-assistant-supports-it","time":{"date":"2023-06-10","startTime":"16:10","endTime":"16:40"},"timeslots":[{"date":"2023-06-10","startTime":"16:10","endTime":"16:40"}]},{"id":404,"topic":true,"remote_presentation":false,"display":"How to build a powerful AI VR Virtual Assistant with AWS AL\/ML service and OpenAI?","description":"\u003Cp\u003EAWS AI Assistant is a serverless applications and integrates most of the AWS AI\/ML services and Open AI.\u003Cbr \/\u003E\r\nThe most popular tech news in 2023 is the raise of generative AI with Large language models. With those powerful pre-built model or AI API, we can build a very powerful virtual assistant with the combination and integration of all AWS AI\/ML services with OpenAI API or Hugging Face pre-trained model. For my use case, I hope my students learn and use AI but I do want to have certain control and monitoring. So, we want to make it fun and powerful for my students.\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"Cantonese","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Cyrus Wong","community":"IVE","country":"Hong Kong","description":"\u003Cp\u003ECyrus Wong is Data Scientist of Cloud Innovation Centre at the IT Department of the Hong Kong Institute of Vocational Education (Lee Wai Lee). He has achieved all 12 AWS Certifications and actively promotes the use of AWS in different media and events. His projects received four Hong Kong ICT Awards in 2014, 2015, and 2016, and all winning projects are running solely on AWS with Data Science and Machine Learning. One of the winning projects is “AWS Cloud Lab Environment,” an open-sourced project for educators to create tailor-made lab environments on AWS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECyrus also helps to deliver the full-time course “Higher Diploma in Cloud and Data Centre Administration,” which is the first tertiary course in Asia dedicated to provide Cloud Technology training. The course is committed to providing AWS Academy training to Hong Kong students and Cyrus is an AWS Academy Accredited Trainer. He incorporates AI\/ML into his daily curriculum and often writes about projects. Examples include: Analyze Emotion in Video Frame Samples Using Amazon Rekognition on AWS, Build an Amazon Lex Chatbot with Microsoft Excel, and Using AWS AI and Amazon Sumerian in IT Education.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Cyrus%20Wong_square.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-build-powerful-ai-vr-virtual-assistant-aws-alml-service-and-openai","time":{"date":"2023-06-10","startTime":"16:10","endTime":"17:20"},"timeslots":[{"date":"2023-06-10","startTime":"16:10","endTime":"16:40"},{"date":"2023-06-10","startTime":"16:40","endTime":"17:20"}]}]},{"startTime":"16:40","endTime":"17:20","events":[{"id":404,"topic":true,"remote_presentation":false,"display":"How to build a powerful AI VR Virtual Assistant with AWS AL\/ML service and OpenAI?","description":"\u003Cp\u003EAWS AI Assistant is a serverless applications and integrates most of the AWS AI\/ML services and Open AI.\u003Cbr \/\u003E\r\nThe most popular tech news in 2023 is the raise of generative AI with Large language models. With those powerful pre-built model or AI API, we can build a very powerful virtual assistant with the combination and integration of all AWS AI\/ML services with OpenAI API or Hugging Face pre-trained model. For my use case, I hope my students learn and use AI but I do want to have certain control and monitoring. So, we want to make it fun and powerful for my students.\u003C\/p\u003E\r\n","venue":{"name":"Function Hall","weight":2},"language":"Cantonese","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Cyrus Wong","community":"IVE","country":"Hong Kong","description":"\u003Cp\u003ECyrus Wong is Data Scientist of Cloud Innovation Centre at the IT Department of the Hong Kong Institute of Vocational Education (Lee Wai Lee). He has achieved all 12 AWS Certifications and actively promotes the use of AWS in different media and events. His projects received four Hong Kong ICT Awards in 2014, 2015, and 2016, and all winning projects are running solely on AWS with Data Science and Machine Learning. One of the winning projects is “AWS Cloud Lab Environment,” an open-sourced project for educators to create tailor-made lab environments on AWS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECyrus also helps to deliver the full-time course “Higher Diploma in Cloud and Data Centre Administration,” which is the first tertiary course in Asia dedicated to provide Cloud Technology training. The course is committed to providing AWS Academy training to Hong Kong students and Cyrus is an AWS Academy Accredited Trainer. He incorporates AI\/ML into his daily curriculum and often writes about projects. Examples include: Analyze Emotion in Video Frame Samples Using Amazon Rekognition on AWS, Build an Amazon Lex Chatbot with Microsoft Excel, and Using AWS AI and Amazon Sumerian in IT Education.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2023-05\/Cyrus%20Wong_square.jpg"}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-build-powerful-ai-vr-virtual-assistant-aws-alml-service-and-openai","time":{"date":"2023-06-10","startTime":"16:10","endTime":"17:20"},"timeslots":[{"date":"2023-06-10","startTime":"16:10","endTime":"16:40"},{"date":"2023-06-10","startTime":"16:40","endTime":"17:20"}]}]},{"startTime":"17:30","endTime":"18:00","events":[{"id":371,"topic":true,"remote_presentation":false,"display":"靠開源，去節流，愛護地球","description":"\u003Cp\u003E以用家身份分享利用開源操作系統（Google Chrome OS Flex) 及免費線上軟件\/服務，在非政府機構(NGO)或微小企中，如何達致節省開支並延緩電子垃圾產生。\u003Cbr \/\u003E\r\n亦會分享日常文書工作中使用開源工具（包括人工智能）小貼士。\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall A","weight":0},"language":"Cantonese","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Alan Chu","community":"","country":"Hong Kong","description":"\u003Cp\u003E一個舊IT人，努力環保，停止買電腦十多年，靠用回收再重電腦，繼續在IT界生存。\u003C\/p\u003E\r\n","thumbnail":""}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/kaokaiyuanqujieliuaihudeqiu","time":{"date":"2023-06-10","startTime":"17:30","endTime":"18:00"},"timeslots":[{"date":"2023-06-10","startTime":"17:30","endTime":"18:00"}]},{"id":406,"topic":true,"remote_presentation":false,"display":"Imagine a Decentralized Social Internet: AT Protocol, Farcaster, and Beyond","description":"\u003Cp\u003EKa-Cheong, the Director of Internet Society Hong Kong and an open-source contributor to AT Protocol and Farcaster, leads a discussion on the future of a decentralized social internet. Explore how these emerging protocols could replace traditional, capitalistic social networks like Twitter, and delve into the possibilities, challenges, and implications of such a transformation.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EKey Topics:\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EDiscussing the flaws and limitations of current social networks\u003C\/li\u003E\r\n\t\u003Cli\u003EA technical overview of AT Protocol and Farcaster protocols\u003C\/li\u003E\r\n\t\u003Cli\u003EHow about Mastodon? What\u0027s wrong with it?\u003C\/li\u003E\r\n\t\u003Cli\u003ENavigating content moderation dilemmas in a decentralized world\u003C\/li\u003E\r\n\t\u003Cli\u003EOvercoming the challenges of boostrapping a new social internet\u003C\/li\u003E\r\n\t\u003Cli\u003EThe (social) internet is made of cats\u003C\/li\u003E\r\n\t\u003Cli\u003EMonetization strategies for open protocols: Opportunities and obstacles\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Grand Hall B","weight":1},"language":"Cantonese","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Ka Cheong Chu","community":"Internet Society Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EOpen source contributor to AT Protocol and Farcaster, Director at Internet Society Hong Kong, Ex-Apple Software Engineer\u003C\/p\u003E\r\n","thumbnail":""}],"video_streamings":[],"live_accessories":{"hackmd":"","slido":"","survey":"","freenode_irc":"","liberachat_irc":"","qna_url":""},"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/imagine-decentralized-social-internet-protocol-farcaster-and-beyond","time":{"date":"2023-06-10","startTime":"17:30","endTime":"18:00"},"timeslots":[{"date":"2023-06-10","startTime":"17:30","endTime":"18:00"}]}]}]}]}